app/views/users/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ? ORDER BY "books"."id" DESC  [["user_id", 1]]
---
            <td><%= book.body %></td>
            <td><%= book.book_comments.count%></td>

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
          <td>
            コメント数<%= book.book_comments.count %>