app/views/books/index.html.erb

        </td>
        <td>コメント数<%= book.book_comments.count %></td>
---
SELECT "books".* FROM "books" ORDER BY "books"."id" DESC