app/views/books/show.html.erb

SELECT  "books".* FROM "books" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
            <% end %>
            <td>コメント数<%= @book_detail.book_comments.count%></td>