app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."id" DESC
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @books = Book.all.order(id: "DESC")

    #投稿部分
    @user = User.find(current_user.id)

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aaa"], ["body", "bbb"], ["user_id", 1], ["created_at", "2020-02-05 03:29:17.896113"], ["updated_at", "2020-02-05 03:29:17.896113"]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" ORDER BY "books"."id" DESC
---
  def create
    book = current_user.books.new(book_params)
    if book.save
      redirect_to book_path(book)
      flash[:notice] = "You have creatad book successfully."
    else
      @book = book
      @user = User.find(current_user.id)
      @books = Book.all.order(id: "DESC")

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]
---
  def show
    #bookで定義していたら投稿欄のところと重複した
    @book_detail = Book.find(params[:id])
    # 子から親を参照している
    @user = @book_detail.user
    @book = Book.new

    # コメント部分
    @book_comments = @book_detail.book_comments.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 38], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "a"], ["body", "b"], ["updated_at", "2020-02-05 12:22:11.224982"], ["id", 38]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    book = Book.find(params[:id])
    if book.update(book_params)
      redirect_to book_path(book)
      flash[:notice] = "You have update book successfully"
    else
      @book = book
      @user = User.find(current_user.id)